# Rps Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..Rps Property
SymbolTypeId Class See Also
---
Symbol RPS, indicating unit Revolutions per second.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Rps { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Rps As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Rps {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace